In [106]:
import pandas as pd
from sqlalchemy import create_engine, text
import sqlite3

In [107]:
conn = sqlite3.connect("sales_data.db", timeout=10)
cursor = conn.cursor()
print("Connected to SQLite successfully!")

Connected to SQLite successfully!

In [108]:
# Create the table
cursor.execute("""
CREATE TABLE IF NOT EXISTS sales1 (
    order_id INTEGER PRIMARY KEY,
    order_date DATE NOT NULL,
    amount NUMERIC NOT NULL,
    product TEXT NOT NULL,
    order_qty INTEGER NOT NULL
);
""")

conn.commit()  # Save changes
print("Table 'sales1' created successfully!")

# Close the connection
conn.close()

Table 'sales1' created successfully!

In [109]:
conn = sqlite3.connect("my_database.db", timeout=10)
query="SELECT * FROM sales1"
df = pd.read_sql_query(query, conn)

In [110]:
df

   order_id  order_date   amount     product  order_qty
0         1  2025-05-01  1500.00      Laptop          2
1         2  2025-04-30  1200.50  Smartphone          3
2         3  2025-04-29   750.75  Headphones          5
3         4  2025-04-28  1800.00     Monitor          1
4         5  2025-04-27   950.25    Keyboard          4
5         6  2025-04-26  1100.75       Mouse          6
6         7  2025-04-25  1350.00      Tablet          2
7         8  2025-04-24   500.50   USB Drive         10
8         9  2025-04-23  2500.00     Printer          1
9        10  2025-04-22  1450.75      Router          3

In [111]:
query="SELECT sum(order_qty) as Total_Order FROM sales1"
df = pd.read_sql_query(query, conn)
print(df)

   Total_Order
0           37

In [112]:
query="SELECT sum(amount) as Total_Amount FROM sales1"
df = pd.read_sql_query(query, conn)
print(df)

   Total_Amount
0       13103.5

In [113]:
query = "SELECT product, SUM(order_qty) AS total_qty, SUM(order_qty * amount) AS revenue FROM sales1 GROUP BY product"
df=pd.read_sql_query(query,conn)
print(df)

      product  total_qty  revenue
0  Headphones          5  3753.75
1    Keyboard          4  3801.00
2      Laptop          2  3000.00
3     Monitor          1  1800.00
4       Mouse          6  6604.50
5     Printer          1  2500.00
6      Router          3  4352.25
7  Smartphone          3  3601.50
8      Tablet          2  2700.00
9   USB Drive         10  5005.00

In [114]:
query = "SELECT * FROM sales1 where product='Laptop'"
df=pd.read_sql_query(query,conn)
print(df)

   order_id  order_date  amount product  order_qty
0         1  2025-05-01    1500  Laptop          2